Tekla.Structures.DirectManipulation.Adapter.Picker.PickerConfigurationExtensions
The Tekla.Structures.DirectManipulation.Adapter.Picker.PickerConfigurationExtensions class provides a set of extension methods for the Tekla.Structures.Model.UI.Picker type.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerConfigurationExtensions.ToNativeConfiguration(Tekla.BIM.DirectManipulation.Services.Picking.PickerConfiguration)
Parses a Tekla.BIM.DirectManipulation.Services.Picking.PickerConfiguration instance to a Tekla.Structures.ModelInternal.dotUIPicker_t value.
Throws System.ApplicationException:
An System.ApplicationException is thrown when the configuration cannot be converted.
configuration: The Tekla.BIM.DirectManipulation.Services.Picking.PickerConfiguration instance to parse.
Returns: The parsed Tekla.Structures.ModelInternal.dotUIPicker_t value.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerConfigurationExtensions.TryParsePickType(Tekla.BIM.DirectManipulation.Services.Picking.PickerConfiguration,Tekla.Structures.Model.UI.Picker.PickPointEnum@)
Tries to parse the Tekla.BIM.DirectManipulation.Services.Picking.PickType to a Tekla.Structures.Model.UI.Picker.PickPointEnum value.
pickerConfiguration: The configuration to parse.
pointPickType: The parsed value, if success.
Returns: True if parsing is possible; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerConfigurationExtensions.TryParsePickType(Tekla.BIM.DirectManipulation.Services.Picking.PickerConfiguration,Tekla.Structures.Model.UI.Picker.PickObjectEnum@)
Tries to parse the Tekla.BIM.DirectManipulation.Services.Picking.PickType to a Tekla.Structures.Model.UI.Picker.PickObjectEnum value.
pickerConfiguration: The configuration to parse.
objectPickType: The parsed value, if success.
Returns: True if parsing is possible; otherwise, false.